### DataFrames : Seleccion de datos con una condicion

In [7]:
import pandas as pd
import numpy as np

In [8]:
filas = 'ventas1 ventas2 ventas3'.split()
filas

['ventas1', 'ventas2', 'ventas3']

In [12]:
columnas = 'zonaA zonaB zonaC'.split()
columnas

['zonaA', 'zonaB', 'zonaC']

In [13]:
datos = [ [120,340,250], [210,450,250], [310,210,140] ]
datos

[[120, 340, 250], [210, 450, 250], [310, 210, 140]]

In [14]:
dataframe = pd.DataFrame(datos,filas,columnas)

In [15]:
dataframe

         zonaA  zonaB  zonaC
ventas1    120    340    250
ventas2    210    450    250
ventas3    310    210    140

In [16]:
condicion = dataframe > 200

In [17]:
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas1    NaN    340  250.0
ventas2  210.0    450  250.0
ventas3  310.0    210    NaN

In [18]:
dataframe

         zonaA  zonaB  zonaC
ventas1    120    340    250
ventas2    210    450    250
ventas3    310    210    140

In [19]:
condicion = dataframe['zonaA'] > 200
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas2    210    450    250
ventas3    310    210    140

In [20]:
dataframe

         zonaA  zonaB  zonaC
ventas1    120    340    250
ventas2    210    450    250
ventas3    310    210    140

In [23]:
condicion = (dataframe['zonaA'] > 200) | (dataframe['zonaB'] > 300)
dataframe[condicion]

         zonaA  zonaB  zonaC
ventas1    120    340    250
ventas2    210    450    250
ventas3    310    210    140

In [25]:
dataframe[condicion][['zonaB','zonaC']]

         zonaB  zonaC
ventas1    340    250
ventas2    450    250
ventas3    210    140